bright-pan/smartlock2/bsp/stm32f10x/drivers/fprint.c
/*********************************************************************
 * Filename:			fprint.c
 *
 * Description:
 *
 * Author:				Bright Pan
 * Email:				bright_pan@yuettak.com
 * Date:				2014-03-25
 *
 * Modify:
 *
 * Copyright (C) 2014 Yuettak Co.,Ltd
 ********************************************************************/

#include <stm32f10x.h>
#include "untils.h"
#include "board.h"
#include "fprint.h"
#include "gpio_pin.h"
#include "gpio_pwm.h"
#include "comm.h"

#define FPRINT_MAIL_MAX_MSGS 10

#define FPRINT_DEBUG 1
#define DEVICE_NAME_FPRINT "uart2"
#define FPRINT_TEMPLATE_OFFSET 0 // 0 <= offset <= 999
#define FPRINT_TEMPLATE_SIZE (1000 - 1) // 1 <= offset <= 2000
#define FPRINT_TEMPLATE_ID_START FPRINT_TEMPLATE_OFFSET
#define FPRINT_TEMPLATE_ID_END (FPRINT_TEMPLATE_OFFSET + KEY_NUMBERS - 1)

//head define
#define FPRINT_FRAME_START 0xef01
//#define FPRINT_FRAME_ADDR 0x06030024
#define FPRINT_FRAME_ADDR 0xffffffff
#define FPRINT_FRAME_PW 0x00000000

#define FPRINT_FRAME_PID_CMD 0x01
#define FPRINT_FRAME_PID_DATA 0x02
#define FPRINT_FRAME_PID_ACK 0x07
#define FPRINT_FRAME_PID_END 0x08
//cmd define
#define FPRINT_FRAME_CMD_VERIFY 0x13
#define FPRINT_FRAME_CMD_EMPTY 0x0d
#define FPRINT_FRAME_CMD_GET_ECHO 0x53
#define FPRINT_FRAME_CMD_SET_PARAM 0x0e
#define FPRINT_FRAME_CMD_SET_ADDR 0x15
#define FPRINT_FRAME_CMD_STORE_CHAR 0x06
#define FPRINT_FRAME_CMD_LOAD_CHAR 0x07
#define FPRINT_FRAME_CMD_UP_CHAR 0x08
#define FPRINT_FRAME_CMD_DOWN_CHAR 0x09
#define	FPRINT_FRAME_CMD_DEL_CHAR 0x0c
#define FPRINT_FRAME_CMD_GET_STATUS 0x46
#define FPRINT_FRAME_CMD_GET_IMAGE 0x01
#define FPRINT_FRAME_CMD_GENERATE 0x02
#define FPRINT_FRAME_CMD_MERGE 0x05
#define FPRINT_FRAME_CMD_SEARCH 0x04
//result define
#define FPRINT_FRAME_ERR_SUCCESS 0x00
#define FPRINT_FRAME_ERR_FAIL 0x01
#define FPRINT_FRAME_ERR_FP_NOT_DETECTED 0x02

typedef enum {

	FPRINT_EOK,
	FPRINT_EERROR,
	FPRINT_ERESPONSE,
	FPRINT_EEXIST,
    FPRINT_ENO_DETECTED,
	FPRINT_EINVALID,
    FPRINT_EEXCEPTION,

}FPRINT_ERROR_TYPEDEF;

typedef enum {

	FPRINT_CMD_INIT,
	FPRINT_CMD_ENROLL,
	FPRINT_CMD_DELETE,
    FPRINT_CMD_VERIFY,
	FPRINT_CMD_RESET,

}FPRINT_CMD_TYPEDEF;

typedef struct {

	FPRINT_CMD_TYPEDEF cmd;
	uint16_t *key_id;
    uint8_t *buf;
    uint16_t size;
	rt_sem_t result_sem;
	FPRINT_ERROR_TYPEDEF *result;

}FPRINT_MAIL_TYPEDEF;

typedef struct{

    uint8_t start[2];
	uint8_t addr[4];
	uint8_t pid;
	uint8_t len[2];

}FPRINT_FRAME_HEAD_TYPEDEF;

typedef struct {
    uint8_t cmd;
    uint8_t pw[4];
}FPRINT_FRAME_REQ_VERIFY_TYPEDEF;

typedef struct {
    uint8_t cmd;
}FPRINT_FRAME_REQ_EMPTY_TYPEDEF;

typedef struct {
    uint8_t cmd;
    uint8_t type;
    uint8_t data;
}FPRINT_FRAME_REQ_SET_PARAM_TYPEDEF;
typedef struct {
    uint8_t cmd;
    uint8_t addr[4];
}FPRINT_FRAME_REQ_SET_ADDR_TYPEDEF;
typedef struct {
    uint8_t cmd;
}FPRINT_FRAME_REQ_GET_IMAGE_TYPEDEF;
typedef struct {
    uint8_t cmd;
    uint8_t buf_id;
}FPRINT_FRAME_REQ_GENERATE_TYPEDEF;
typedef struct {
    uint8_t cmd;
}FPRINT_FRAME_REQ_MERGE_TYPEDEF;

typedef struct {

    uint8_t cmd;
    uint8_t buf_id;

}FPRINT_FRAME_REQ_UP_CHAR_TYPEDEF;
typedef struct {

    uint8_t cmd;
    uint8_t buf_id;

}FPRINT_FRAME_REQ_DOWN_CHAR_TYPEDEF;
typedef struct {

    uint8_t cmd;
    uint8_t buf_id;
    uint8_t template_id[2];

}FPRINT_FRAME_REQ_STORE_CHAR_TYPEDEF;

typedef struct {

    uint8_t cmd;
    uint8_t template_id[2];
    uint8_t size[2];

}FPRINT_FRAME_REQ_DEL_CHAR_TYPEDEF;

typedef struct {

    uint8_t cmd;
    uint8_t buf_id;
    uint8_t template_id[2];
    uint8_t size[2];

}FPRINT_FRAME_REQ_SEARCH_TYPEDEF;

typedef union {

    FPRINT_FRAME_REQ_VERIFY_TYPEDEF req_verify;
    FPRINT_FRAME_REQ_EMPTY_TYPEDEF req_empty;
    FPRINT_FRAME_REQ_SET_PARAM_TYPEDEF req_set_param;
    FPRINT_FRAME_REQ_SET_ADDR_TYPEDEF req_set_addr;
    FPRINT_FRAME_REQ_GET_IMAGE_TYPEDEF req_get_image;
    FPRINT_FRAME_REQ_GENERATE_TYPEDEF req_generate;
    FPRINT_FRAME_REQ_MERGE_TYPEDEF req_merge;
    FPRINT_FRAME_REQ_UP_CHAR_TYPEDEF req_up_char;
    FPRINT_FRAME_REQ_DOWN_CHAR_TYPEDEF req_down_char;
    FPRINT_FRAME_REQ_STORE_CHAR_TYPEDEF req_store_char;
    FPRINT_FRAME_REQ_DEL_CHAR_TYPEDEF req_del_char;
    FPRINT_FRAME_REQ_SEARCH_TYPEDEF req_search;

}FPRINT_FRAME_REQ_DATA_TYPEDEF;

typedef struct {

    uint8_t result;
    uint8_t cs[2];
    
}FPRINT_FRAME_REP_VERIFY_TYPEDEF;

typedef struct {

    uint8_t result;
    uint8_t cs[2];

}FPRINT_FRAME_REP_EMPTY_TYPEDEF;

typedef struct {

    uint8_t result;
    uint8_t cs[2];
    
}FPRINT_FRAME_REP_SET_PARAM_TYPEDEF;

typedef struct {

    uint8_t result;
    uint8_t cs[2];
    
}FPRINT_FRAME_REP_SET_ADDR_TYPEDEF;
typedef struct {

    uint8_t result;
    uint8_t cs[2];
    
}FPRINT_FRAME_REP_GET_IMAGE_TYPEDEF;
typedef struct {

    uint8_t result;
    uint8_t cs[2];

}FPRINT_FRAME_REP_GENERATE_TYPEDEF;
typedef struct {

    uint8_t result;
    uint8_t cs[2];

}FPRINT_FRAME_REP_MERGE_TYPEDEF;
typedef struct {

    uint8_t result;
    uint8_t cs[2];

}FPRINT_FRAME_REP_UP_CHAR_TYPEDEF;

typedef struct {

    uint8_t result;
    uint8_t cs[2];
    
}FPRINT_FRAME_REP_DOWN_CHAR_TYPEDEF;


typedef struct {

    uint8_t result;
    uint8_t cs[2];

}FPRINT_FRAME_REP_STORE_CHAR_TYPEDEF;

typedef struct {

    uint8_t result;
    uint8_t cs[2];

}FPRINT_FRAME_REP_DEL_CHAR_TYPEDEF;

typedef struct {

    uint8_t result;
    uint8_t template_id[2];
    uint8_t score[2];
    uint8_t cs[2];

}FPRINT_FRAME_REP_SEARCH_TYPEDEF;

typedef union {

    FPRINT_FRAME_REP_VERIFY_TYPEDEF rep_verify;
    FPRINT_FRAME_REP_EMPTY_TYPEDEF rep_empty;
    FPRINT_FRAME_REP_SET_PARAM_TYPEDEF rep_set_param;
    FPRINT_FRAME_REP_SET_ADDR_TYPEDEF rep_set_addr;
    FPRINT_FRAME_REP_GET_IMAGE_TYPEDEF rep_get_image;
    FPRINT_FRAME_REP_GENERATE_TYPEDEF rep_generate;
    FPRINT_FRAME_REP_MERGE_TYPEDEF rep_merge;
    FPRINT_FRAME_REP_UP_CHAR_TYPEDEF rep_up_char;
    FPRINT_FRAME_REP_DOWN_CHAR_TYPEDEF rep_down_char;
    FPRINT_FRAME_REP_STORE_CHAR_TYPEDEF rep_store_char;
    FPRINT_FRAME_REP_DEL_CHAR_TYPEDEF rep_del_char;
    FPRINT_FRAME_REP_SEARCH_TYPEDEF rep_search;

}FPRINT_FRAME_REP_DATA_TYPEDEF;


