bright-pan/smartlock2/bsp/stm32f10x/drivers/fprint.c
        if (error == FPRINT_ERESPONSE)
            goto error_process;
        
        reverse((uint8_t *)&data_length, head.len, sizeof(data_length));
/*

        if (data_length > size)
            goto error_process;
*/
        data_length -= 2;

        if (data_length > size)
            goto error_process;

        switch (head.pid)
        {
            case FPRINT_FRAME_PID_DATA:
                {
                    size -= data_length;
                    break;
                }
            case FPRINT_FRAME_PID_END:
                {
                    size = 0;
                    break;
                }

            default :
                {
                    size = 0;
                    break;
                }
        }

        recv_cnts = rt_device_read(fprint_device, 0, (uint8_t *)buf + data_offset, data_length);
        if (recv_cnts < data_length)
            goto error_process;
        cs = 0;
        cs = check_sum((uint8_t *)&head + 6, sizeof(head) - 6);
        cs +=  check_sum((uint8_t *)buf + data_offset, data_length);
        check = 0;
        recv_cnts = rt_device_read(fprint_device, 0, (uint8_t *)&check, 2);
        if (recv_cnts < 2)
            goto error_process;
#if (defined RT_USING_FINSH) && (defined FPRINT_DEBUG)
        rt_kprintf("\nfprint recv :---------------------\n");
        print_hex((uint8_t *)&head, sizeof(head));
        print_hex((uint8_t *)buf+data_offset, data_length);
        print_hex((uint8_t *)&check, sizeof(check));
        rt_kprintf("------------------------------------\n");
#endif // RT_USING_FINSH
        //reverse((uint8_t *)&check, (uint8_t *)&check, sizeof(check));
        __REV16(check);
        if (cs==check)
        {
            error = FPRINT_EOK;
        }

        data_offset += data_length;
    }
error_process:

	return data_offset;

}

__STATIC_INLINE uint16_t
fprint_frame_send_data(uint8_t *buf, uint16_t size)
{
	uint16_t cs;
	rt_device_t fprint_device;
	uint16_t data_length, data_offset;
    FPRINT_FRAME_HEAD_TYPEDEF head;
    uint16_t start = FPRINT_FRAME_START;
    uint32_t addr = FPRINT_FRAME_ADDR;
    data_length = 0;
    data_offset = 0;

	fprint_device = device_enable(DEVICE_NAME_FPRINT);
	if (fprint_device == RT_NULL)
		goto error_process;
    while (size > 0)
    {
        rt_memset(&head, 0, sizeof(head));

        reverse(head.start, (uint8_t *)&start, sizeof(start));
        reverse(head.addr, (uint8_t *)&addr, sizeof(addr));

        if (size > 256) {
            data_length = 256;
            head.pid = FPRINT_FRAME_PID_DATA;
        } else {
            data_length = size;
            head.pid = FPRINT_FRAME_PID_END;
        }
        size -= data_length;
        
        //reverse((uint8_t *)&data_length, head.len, sizeof(data_length));


        data_length += 2;
        reverse(head.len, (uint8_t *)&data_length, sizeof(data_length));
        data_length -= 2;
        cs = check_sum((uint8_t *)&head+6, sizeof(head)-6) + check_sum(buf + data_offset, data_length);
        rt_device_write(fprint_device, 0, &head, sizeof(head));
        rt_device_write(fprint_device, 0, buf + data_offset, data_length);
        cs = __REV16(cs);
        rt_device_write(fprint_device, 0, &cs, 2);

#if (defined RT_USING_FINSH) && (defined FPRINT_DEBUG)
        rt_kprintf("\nfprint send :---------------------\n");
        print_hex((uint8_t *)&head, sizeof(head));
        print_hex((uint8_t *)buf + data_offset, data_length);
        print_hex((uint8_t *)&cs, sizeof(cs));
        rt_kprintf("------------------------------------\n");
#endif
        data_offset += data_length;
    }
error_process:

	return data_offset;

}


__STATIC_INLINE FPRINT_ERROR_TYPEDEF
fprint_frame_recv(uint8_t cmd, FPRINT_FRAME_HEAD_TYPEDEF *frame_head,
				  FPRINT_FRAME_REP_DATA_TYPEDEF *rep_data)
{
	uint16_t cs;
	rt_device_t fprint_device;
	uint16_t data_length;
	rt_size_t recv_cnts;
	FPRINT_ERROR_TYPEDEF error;
	uint8_t cnts;

    data_length = 0;

	error = FPRINT_EERROR;

	fprint_device = device_enable(DEVICE_NAME_FPRINT);
	if (fprint_device == RT_NULL)
		goto error_process;
	for (cnts = 0; cnts < 20; cnts++) {
		rt_thread_delay(20);
		recv_cnts = rt_device_read(fprint_device, 0, frame_head, sizeof(*frame_head));
		if (recv_cnts != sizeof(*frame_head)) {
			if (recv_cnts == 0) {
				error = FPRINT_ERESPONSE;
				continue;
			} else {
				error = FPRINT_EERROR;
				goto error_process;
			}
		} else {
			error = FPRINT_EERROR;
			break;
		}
	}

	if (error == FPRINT_ERESPONSE)
		goto error_process;
    
    reverse((uint8_t *)&data_length, frame_head->len, sizeof(data_length));

	recv_cnts = rt_device_read(fprint_device, 0, (uint8_t *)rep_data, data_length);
	if (recv_cnts < data_length)
		goto error_process;
    cs = check_sum((uint8_t *)frame_head + 6, sizeof(*frame_head) - 6);
    cs +=  check_sum((uint8_t *)rep_data, data_length-2);
	if (*((uint8_t *)rep_data + data_length -2) == ((uint8_t *)&cs)[1] && *((uint8_t *)rep_data + data_length -1) == ((uint8_t *)&cs)[0])
	{
		error = FPRINT_EOK;
	}
#if (defined RT_USING_FINSH) && (defined FPRINT_DEBUG)
	rt_kprintf("\nfprint recv :---------------------\n");
	print_hex((uint8_t *)frame_head, sizeof(*frame_head));
	print_hex((uint8_t *)rep_data, data_length);
	rt_kprintf("------------------------------------\n");
#endif // RT_USING_FINSH

error_process:

	return error;
}

__STATIC_INLINE FPRINT_ERROR_TYPEDEF
fprint_frame_process(uint8_t cmd, FPRINT_FRAME_REQ_DATA_TYPEDEF *req_data, FPRINT_FRAME_REP_DATA_TYPEDEF *rep_data)
{
	FPRINT_ERROR_TYPEDEF error;
	FPRINT_FRAME_HEAD_TYPEDEF head;

    uint16_t start = FPRINT_FRAME_START;
    uint32_t addr = FPRINT_FRAME_ADDR;
    error = FPRINT_EERROR;
    switch (cmd)
    {
        case FPRINT_FRAME_CMD_VERIFY:
        case FPRINT_FRAME_CMD_EMPTY:
        case FPRINT_FRAME_CMD_SET_PARAM:
        case FPRINT_FRAME_CMD_SET_ADDR:
        case FPRINT_FRAME_CMD_GET_IMAGE:
        case FPRINT_FRAME_CMD_GENERATE:        
        case FPRINT_FRAME_CMD_MERGE:
        case FPRINT_FRAME_CMD_UP_CHAR:
        case FPRINT_FRAME_CMD_DOWN_CHAR:
        case FPRINT_FRAME_CMD_STORE_CHAR:
        case FPRINT_FRAME_CMD_DEL_CHAR:
        case FPRINT_FRAME_CMD_SEARCH:
            {
                break;
            }
        default :
            {
                RT_DEBUG_LOG(FPRINT_DEBUG, ("the finger print frame request cmd 0x%02X is invalid!\n", cmd));
                goto process_error;
            }
    }

	error = FPRINT_EERROR;


