bright-pan/smartlock2/bsp/stm32f10x/drivers/fprint.c
	// generate fprint template to buf1
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
	req_data->req_generate.buf_id = 1;
	error = fprint_frame_process(FPRINT_FRAME_CMD_GENERATE,
                                    req_data, rep_data);

	if (error != FPRINT_EOK)
		return error;
	// get fprint image
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
	error = fprint_frame_process(FPRINT_FRAME_CMD_GET_IMAGE,
                                    req_data, rep_data);
	if (error != FPRINT_EOK)
		return error;

	// generate fprint template to buf2
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
	req_data->req_generate.buf_id = 2;
	error = fprint_frame_process(FPRINT_FRAME_CMD_GENERATE,
                                    req_data, rep_data);

	if (error != FPRINT_EOK)
		return error;

	// merge
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
	error = fprint_frame_process(FPRINT_FRAME_CMD_MERGE,
                                    req_data, rep_data);
	if (error != FPRINT_EOK)
		return error;

    // get fprint template from rambuf0
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
    req_data->req_up_char.buf_id = 1;
	error = fprint_frame_process(FPRINT_FRAME_CMD_UP_CHAR,
                                    req_data, rep_data);
    if (error != FPRINT_EOK)
		return error;
    fprint_frame_recv_data(buf, 512);
    
	return error;
}

static FPRINT_ERROR_TYPEDEF
fprint_verify(FPRINT_FRAME_REQ_DATA_TYPEDEF *req_data, FPRINT_FRAME_REP_DATA_TYPEDEF *rep_data)
{

	FPRINT_ERROR_TYPEDEF error = FPRINT_EERROR;
    uint16_t temp;
	// get fprint image
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
	error = fprint_frame_process(FPRINT_FRAME_CMD_GET_IMAGE,
                                    req_data, rep_data);
	if (error != FPRINT_EOK)
		return error;

	// generate fprint template to buf1
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
	req_data->req_generate.buf_id = 1;
	error = fprint_frame_process(FPRINT_FRAME_CMD_GENERATE,
                                    req_data, rep_data);

	if (error != FPRINT_EOK)
		return error;
	// search fprint template to rambuf0
	rt_memset(req_data, 0, sizeof(*req_data));
    rt_memset(rep_data, 0, sizeof(*rep_data));
    req_data->req_search.buf_id = 1;
    temp = FPRINT_TEMPLATE_ID_START;
    reverse(req_data->req_search.template_id, (uint8_t *)&temp, sizeof(temp));
    temp = FPRINT_TEMPLATE_ID_END - FPRINT_TEMPLATE_ID_START;
    reverse(req_data->req_search.size, (uint8_t *)&temp, sizeof(temp));

	error = fprint_frame_process(FPRINT_FRAME_CMD_SEARCH,
                                    req_data, rep_data);

	return error;
}

static void
fprint_thread_entry(void *parameters)
{
	rt_err_t result;
	//rt_device_t fprint_device;
	FPRINT_MAIL_TYPEDEF fprint_mail;
	FPRINT_FRAME_REQ_DATA_TYPEDEF req_data;
    FPRINT_FRAME_REP_DATA_TYPEDEF rep_data;
	FPRINT_ERROR_TYPEDEF error;
    int temp;
	//fprint_device = device_enable(DEVICE_NAME_FPRINT)
    uint8_t buf[512];
    
    error = FPRINT_EERROR;
	while (1)
	{
		result = rt_mq_recv(fprint_mq, &fprint_mail, sizeof(fprint_mail), 500);
		if (result == RT_EOK)
		{
			switch(fprint_mail.cmd)
			{
				case FPRINT_CMD_INIT:
					{
						fprint_reset();
						error = fprint_init(buf, &req_data, &rep_data);
						break;
					}
				case FPRINT_CMD_ENROLL:
					{
                        error = fprint_enroll(buf,&req_data, &rep_data);
						if (error == FPRINT_EOK) {
                            temp = device_config_key_create(KEY_TYPE_FPRINT, buf);
							if (temp < 0) {
								RT_DEBUG_LOG(FPRINT_DEBUG, ("the finger print key save failure!\n"));
								error = FPRINT_EERROR;
							} else {
                                // store fprint template to template_id
                                rt_memset(&req_data, 0, sizeof(req_data));
                                rt_memset(&rep_data, 0, sizeof(rep_data));
                                temp += FPRINT_TEMPLATE_OFFSET;
                                reverse(req_data.req_store_char.template_id, (uint8_t *)&temp, 2);
                                req_data.req_store_char.buf_id = 1;
                                error = fprint_frame_process(FPRINT_FRAME_CMD_STORE_CHAR,
                                                                &req_data, &rep_data);
                            }
                        }
                        if (error == FPRINT_EOK) {
                            rt_memcpy(fprint_mail.buf, buf, 512);
                            *fprint_mail.key_id = (uint16_t)temp;
                        }
						break;
					}
				case FPRINT_CMD_DELETE:
					{

                        rt_memset(&req_data, 0, sizeof(req_data));
                        rt_memset(&rep_data, 0, sizeof(rep_data));
						temp = *fprint_mail.key_id + FPRINT_TEMPLATE_OFFSET;
                        reverse(req_data.req_del_char.template_id, (uint8_t *)&(temp), 2);
						temp = fprint_mail.size + FPRINT_TEMPLATE_OFFSET;
                        reverse(req_data.req_del_char.size, (uint8_t *)&temp, 2);
                        error = fprint_frame_process(FPRINT_FRAME_CMD_DEL_CHAR,
                                                        &req_data, &rep_data);
                        break;
					}
				case FPRINT_CMD_VERIFY:
					{
                        static uint16_t f_detect = 0;
                        static uint16_t r_detect = 0;
                        static uint16_t template_id = 0;
                        error = fprint_verify(&req_data, &rep_data);
                        if (error == FPRINT_EOK) {

                            reverse((uint8_t *)&template_id, rep_data.rep_search.template_id, 2);
                            RT_DEBUG_LOG(FPRINT_DEBUG, ("fprint verify is exist, %d\n", template_id - FPRINT_TEMPLATE_OFFSET));
                            if(fprintf_ok_fun != RT_NULL)
                            {
                                FPINTF_USER key;

                                key.KeyPos = template_id - FPRINT_TEMPLATE_OFFSET;
                                rt_kprintf("key pos : %d\n", key.KeyPos);
                                fprintf_ok_fun((void *)&key);
                            }

