bright-pan/smartlock2/bsp/stm32f10x/drivers/fprint.c
                        }
                        if (error == FPRINT_ENO_DETECTED) {
                            RT_DEBUG_LOG(FPRINT_DEBUG, ("fprint verify is no detected\n"));
                            if(fprintf_null_fun != RT_NULL)
                            {
                                fprintf_null_fun(RT_NULL);
                            }
                        }
                        if (error == FPRINT_EERROR) {

                            if (f_detect++) {

                            } else {
                                
                                RT_DEBUG_LOG(FPRINT_DEBUG, ("fprint verify is error\n"));
                                if(fprintf_error_fun != RT_NULL)
                                {
                                    FPINTF_USER key;

                                    key.KeyPos = 0xffff;
                                    fprintf_error_fun((void *)&key);
                                }
                            }
                        } else {
                            f_detect = 0;
                        }
                        if (error == FPRINT_ERESPONSE) {
                            if (r_detect++ > 1000) {
                                RT_DEBUG_LOG(FPRINT_DEBUG, ("fprint has no response , may be fault!\n"));
                                fprint_init(buf, &req_data, &rep_data);
                                r_detect = 0;
                            }
                        } else {
                            r_detect = 0;
                        }
                        break;
					}
				default :
					{
                        RT_DEBUG_LOG(FPRINT_DEBUG, ("the finger print cmd is invalid!\n"));
						break;
					}
			}
            if (fprint_mail.result_sem != RT_NULL) {
                *fprint_mail.result = error;
                rt_sem_release(fprint_mail.result_sem);
            }
		}
		else // time out
		{
            /*
            static uint16_t s_detect = 0;
            static uint16_t f_detect = 0;
            static uint16_t r_detect = 0;
            static uint16_t template_id = 0;
            error = fprint_verify(&frame_data);
			if (error == FPRINT_EEXCEPTION) {
#if (defined RT_USING_FINSH)
				rt_kprintf("fprint verify is exception\n");
#endif // RT_USING_FINSH
			}
			if (error == FPRINT_EOK) {
                if (s_detect++) {
                    if (template_id != frame_data.rep_search.template_id) {
                        template_id = frame_data.rep_search.template_id;
                        s_detect = 0;
                    }
                } else {
                    template_id = frame_data.rep_search.template_id;
#if (defined RT_USING_FINSH)
                    rt_kprintf("fprint verify is exist, %d\n", frame_data.rep_search.template_id);
#endif // RT_USING_FINSH
					if(fprintf_ok_fun != RT_NULL)
					{
						FPINTF_USER key;

						key.KeyPos = frame_data.rep_search.template_id - FPRINT_TEMPLATE_OFFSET;
						rt_kprintf("key pos : %d\n", key.KeyPos);
						fprintf_ok_fun((void *)&key);
					}
                }

			} else {

                s_detect = 0;

            }
            if (error == FPRINT_ENO_DETECTED) {
#if (defined RT_USING_FINSH) && (defined FPRINT_DEBUG)
                rt_kprintf("fprint verify is no detected\n");
#endif // RT_USING_FINSH
				if(fprintf_null_fun != RT_NULL)
		        {
					fprintf_null_fun(RT_NULL);
		        }
            }
            if (error == FPRINT_EERROR) {

                if (f_detect++) {

                } else {


#if (defined RT_USING_FINSH)
                    rt_kprintf("fprint verify is error\n");
#endif // RT_USING_FINSH
					if(fprintf_error_fun != RT_NULL)
					{
						FPINTF_USER key;

						key.KeyPos = 0xffff;
						fprintf_error_fun((void *)&key);
					}
                }
            } else {
                f_detect = 0;
            }
            if (error == FPRINT_ERESPONSE) {

                if (r_detect++ > 1000) {

#if (defined RT_USING_FINSH)
                    rt_kprintf("fprint has no response , may be fault!\n");
#endif // RT_USING_FINSH
                    fprint_init(&frame_data);
					r_detect = 0;
                }
            } else {
                r_detect = 0;
            }
        */
        }
        
	}
}

static FPRINT_ERROR_TYPEDEF
send_fp_mail(FPRINT_CMD_TYPEDEF cmd, uint16_t *key_id, uint8_t *buf, uint16_t size, uint8_t flag)
{
	FPRINT_MAIL_TYPEDEF mail;
	rt_err_t result;
	FPRINT_ERROR_TYPEDEF error;

	if (fprint_mq != RT_NULL)
	{
        if (flag) {
            mail.result_sem = rt_sem_create("s_fp", 0, RT_IPC_FLAG_FIFO);
            RT_ASSERT(mail.result_sem != RT_NULL);
        } else {
            mail.result_sem = RT_NULL;
        }
        mail.result = &error;
		mail.cmd = cmd;
		mail.key_id = key_id;
        mail.size = size;
        mail.buf = buf;
		result = rt_mq_send(fprint_mq, &mail, sizeof(mail));
		if (result == -RT_EFULL)
		{
            RT_DEBUG_LOG(FPRINT_DEBUG, ("fprint_mq is full!!!\n"));
		}
		else
		{
            if (flag)
                rt_sem_take(mail.result_sem, RT_WAITING_FOREVER);
            RT_DEBUG_LOG(FPRINT_DEBUG, ("send result is %d\n", *mail.result));
		}
        if (flag)
            rt_sem_delete(mail.result_sem);
	}
	else
	{
        RT_DEBUG_LOG(FPRINT_DEBUG, ("fprint_mq is null!!!\n"));
	}
	return error;
}

static int
rt_fprint_init(void)
{
	rt_thread_t fprint_thread;

    //initial fprint msg queue
	fprint_mq = rt_mq_create("fprint", sizeof(FPRINT_MAIL_TYPEDEF),
							 FPRINT_MAIL_MAX_MSGS, RT_IPC_FLAG_FIFO);
    if (fprint_mq == RT_NULL)
        return -1;
    
    s_fprint = rt_sem_create("s_fprint", 1, RT_IPC_FLAG_FIFO);

    // finger print thread
	fprint_thread = rt_thread_create("fprint", fprint_thread_entry,
									 RT_NULL, 1500, 100, 5);
	if (fprint_thread == RT_NULL)
        return -1;

    rt_thread_startup(fprint_thread);
    return 0;
}

INIT_APP_EXPORT(rt_fprint_init);

int
fp_init(void)
{
    int result = -1;
    
    if (send_fp_mail(FPRINT_CMD_INIT, RT_NULL, RT_NULL, 0, 1) == FPRINT_EOK)
        result = 0;
    
    return result;
}



int
fp_enroll(uint16_t *key_id, uint8_t *buf, uint32_t time)
{
    rt_err_t error;
    int result = -1;

    rt_sem_control(s_fprint, RT_IPC_CMD_RESET,0);
    error = rt_sem_take(s_fprint, time);
    if (error == RT_EOK) {
        if (send_fp_mail(FPRINT_CMD_ENROLL, key_id, buf, 0, 1) == FPRINT_EOK)
            result = *key_id;
    }
    rt_sem_control(s_fprint, RT_IPC_CMD_RESET,(void *)1);
    return result;
}

int
fp_delete(const uint16_t key_id, const uint16_t size)
{
    int result = -1;
    
    if (send_fp_mail(FPRINT_CMD_DELETE, (uint16_t *)&key_id, RT_NULL, size, 1) == FPRINT_EOK)
        result = key_id;
    return result;
}

int
fp_verify(void)
{
    int result = -1;
    if (send_fp_mail(FPRINT_CMD_VERIFY, RT_NULL, RT_NULL, 0, 0) == FPRINT_EOK)
        result = 0;
    return result;
}

void
fp_inform(void)
{
    uint16_t value;

    rt_sem_control(s_fprint, RT_IPC_CMD_GET_VALUE, &value);
    if (value == 0)
    {
        rt_sem_release(s_fprint);
    } else {
        fp_verify();
    }
}

#ifdef RT_USING_FINSH
#include <finsh.h>

void fp_enroll_test(void)
{
    uint16_t key_id;
    uint8_t buf[512];
    if (send_fp_mail(FPRINT_CMD_ENROLL, &key_id, buf, 0, 1) == FPRINT_EOK)
    rt_kprintf("key_id = %d\n--------------------\n", key_id);
    print_hex(buf, 512);
}
FINSH_FUNCTION_EXPORT(fp_init, fp_init[void]);
FINSH_FUNCTION_EXPORT(fp_enroll_test, fp_enroll_test[void]);
FINSH_FUNCTION_EXPORT(fp_delete, fp_delete[uint16]);
FINSH_FUNCTION_EXPORT(fp_verify, fp_verify[void]);

#endif // RT_USING_FINSH
